package c230830;

public class Main {
	public static void main(String[] args) {
		System.out.println("라이브러리란 무엇일까?");
		// 도서관 > 책들이 있다.(정보의 모음)
		// 장소의 생김새 > 각각의 분류로 나누어 관이나 관련관 서적이 모여있는 책장 등.
		// 책 = 데이터
		// 클레스 - 변수(데이터), 메서드(기능)
		// 분류 - 책의 내용, 종류, 
		// 분류 - 데이터나 기능. 주로 기능에 따라 묶음을 만든다.(인터페이스등을 활용해 계산기를 만들어 그것을 하나의 책으로 분류하는 것.)
		
		// 모듈 || 라이브러리 
		// 모듈 > 장비 또는 기계를 새롭게 추가한다.
		// 프로그래밍 상의 모듈 > 폴더, 패키기, 프로젝트 등
		
		// 라이브러리 > library 
		// library > lib
		
		// 프레임워크 || 라이브러리 || 모듈(주로 언어가 가지고 있는 모듈을 이야기 하는 경우가 잦다.)
		// 프레임워크 VS 라이브러리
		// 프레임워크 > 기능의 집합체, frame : 틀, 뼈대 / work : 작업(코드작성) >  규칙이 정해져있는 라이브러리
		// 숙련될 수록 프레임워크가 더 빠름
		
		
	}
}
